Revit 2026 API

# ReinforcementSettingsRebarPresentationInView Property

---

The default presentation mode for rebar sets, when the view direction is perpendicular to the rebar normal and the rebar set is not cut.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RebarPresentationMode RebarPresentationInView { get; set; }
```
```vb
Public Property RebarPresentationInView As RebarPresentationMode
	Get
	Set
```
```cpp
public:
property RebarPresentationMode RebarPresentationInView {
	RebarPresentationMode get ();
	void set (RebarPresentationMode value);
}
```
```fsharp
member RebarPresentationInView : RebarPresentationMode with get, set
```

#### Property Value

RebarPresentationMode

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

All bars in a given rebar set will be visible if:

  * The view is a 3D view.
  * The view direction is not parallel to the rebar normal.

For this case there are no defaults and no overrides in instances.

#### Reference

ReinforcementSettings Class

Autodesk.Revit.DB.Structure Namespace